УТ/src/DataProcessors/CRM_МенеджерПочты/CRM_МенеджерПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_МенеджерПочты</name>
</mdclass:DataProcessor>

УТ/src/InformationRegisters/CRM_ПапкиУчетныхЗаписей/CRM_ПапкиУчетныхЗаписей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ПапкиУчетныхЗаписей</name>
  <resources>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиЭлектронныхПисем</types>
    </type>
  </resources>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПапки</name>
    <type>
      <types>EnumRef.CRM_ВидыПапокЭлектроннойПочты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Enums/CRM_ВидыПапокЭлектроннойПочты/CRM_ВидыПапокЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыПапокЭлектроннойПочты</name>
  <enumValues>
    <name>Входящие</name>
  </enumValues>
  <enumValues>
    <name>Обработанные</name>
  </enumValues>
  <enumValues>
    <name>Черновики</name>
  </enumValues>
  <enumValues>
    <name>Исходящие</name>
  </enumValues>
  <enumValues>
    <name>Отправленные</name>
  </enumValues>
  <enumValues>
    <name>Удаленные</name>
  </enumValues>
  <enumValues>
    <name>НежелательнаяПочта</name>
  </enumValues>
</mdclass:Enum>

УТ/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ДолжностнаяПозиция</name>
    <type>
      <types>CatalogRef.CRM_ДолжностныеПозиции</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от Email рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Планируемый</name>
    <comment>Участвует в планировании проектов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЕмейлДляСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешеноИзменятьКоординаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ТехподдержкаЛогинПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>сфпПрефиксНабора</name>
      <type>
        <types>CatalogRef.сфпПрефиксыИсходящихВызовов</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/DataProcessors/CRM_МенеджерПочты/Forms/ФормаЗагрузкиИсторииПисем/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УчетнаяЗапись = Параметры.Ключ;
	ВариантЗагрузки = "СДаты";
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ДатаЗагрузки = НачалоМесяца(ТекущаяДата);
	ПериодЗагрузки = Новый СтандартныйПериод;
	ПериодЗагрузки.ДатаНачала = ДатаЗагрузки;
	ПериодЗагрузки.ДатаОкончания = КонецМесяца(ДатаЗагрузки);
	
	ЦветОсновнойГолубой = ЦветаСтиля.CRM_ОсновнойГолубой;
	ЦветСерыйДляВторостепенныхФункций = ЦветаСтиля.CRM_СерыйДляВторостепенныхФункций;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики(
		"CRM_Статистика.Взаимодействия.НастройкаУчетнойЗаписи.Удобство.КоличествоНажатияГиперссылкиЗагрузкаПочтыЗаПериод.КоличествоОткрытияФормы");
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Очистить();
	
	Если ВариантЗагрузки = "СДаты" Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаЗагрузки");
	ИначеЕсли ВариантЗагрузки = "ЗаПериод" Тогда
		ПроверяемыеРеквизиты.Добавить("ПериодЗагрузки");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики(
		"CRM_Статистика.Взаимодействия.НастройкаУчетнойЗаписи.Удобство.КоличествоНажатияГиперссылкиЗагрузкаПочтыЗаПериод.КоличествоЗакрытияФормы");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаЗагрузкиПриИзменении(Элемент)
	
	CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики(
		"CRM_Статистика.Взаимодействия.НастройкаУчетнойЗаписи.Удобство.КоличествоНажатияГиперссылкиЗагрузкаПочтыЗаПериод.КоличествоВыбораДаты");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбрабатыватьКакНовыеПриИзменении(Элемент)
	
	CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики(
		"CRM_Статистика.Взаимодействия.НастройкаУчетнойЗаписи.Удобство.КоличествоНажатияГиперссылкиЗагрузкаПочтыЗаПериод.КоличествоВключенияКнопкиОбрабатыватьКакНовые");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьВариантЗагрузки(Команда)
	
	ИмяКоманды = Команда.Имя;
	Элементы.СтраницыВариантыЗагрузки.ТекущаяСтраница = Элементы["Страница" + ИмяКоманды];
	
	Для Каждого Элемент Из Элементы.ГруппаВариантовЗагрузки.ПодчиненныеЭлементы Цикл
		Элемент.Пометка = Ложь;
		Элемент.ЦветФона = ЦветСерыйДляВторостепенныхФункций;
	КонецЦикла;
	Элемент = Элементы[ИмяКоманды];
	Элемент.Пометка = Истина;
	Элемент.ЦветФона = ЦветОсновнойГолубой;
	
	ВариантЗагрузки = СтрЗаменить(ИмяКоманды, "ВариантЗагрузки", "");
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики(
		"CRM_Статистика.Взаимодействия.НастройкаУчетнойЗаписи.Удобство.КоличествоНажатияГиперссылкиЗагрузкаПочтыЗаПериод.КоличествоВыбораКнопкиЗагрузить");
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучениеПисемВыполняется Тогда
		
		ПолучениеПисемВыполняется = Ложь;
		НастроитьЭлементыФормы(ПолучениеПисемВыполняется);
		ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
		
		Возврат;
		
	КонецЕсли;
	
	ПолучениеПисемВыполняется = Истина;
	НастроитьЭлементыФормы(ПолучениеПисемВыполняется);
	
	ДлительнаяОперация = ПолучитьПочтуВФоне();
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		ЗагрузитьЗавершение(ДлительнаяОперация, Новый Структура());
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ПараметрыОжидания.Интервал = 1;
		ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ПрогрессЗагрузки", ЭтотОбъект); 
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьЗавершение", ЭтотОбъект, Новый Структура());
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики(
		"CRM_Статистика.Взаимодействия.НастройкаУчетнойЗаписи.Удобство.КоличествоНажатияГиперссылкиЗагрузкаПочтыЗаПериод.КоличествоВыбораКнопкиЗакрыть");
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьПочтуВФоне()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВариантЗагрузки = "СДаты" Тогда
		ДатаНачалаПериода = ДатаЗагрузки;
		ДатаОкончанияПериода = КонецДня(ТекущаяДатаСеанса()) + 1;
	ИначеЕсли ВариантЗагрузки = "ЗаПериод" Тогда
		ДатаНачалаПериода = ПериодЗагрузки.ДатаНачала;
		ДатаОкончанияПериода = ПериодЗагрузки.ДатаОкончания + 1;
	КонецЕсли;
	
	УчетныеЗаписиПользователя = Новый Массив;
	УчетныеЗаписиПользователя.Добавить(УчетнаяЗапись);
	
	Если CRM_Взаимодействия.ФоновоеЗаданиеПолучениеОтправкаПочтыВыполняется(УчетныеЗаписиПользователя) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Получение почты уже выполняется. Пожалуйста, подождите...'"));
		Элементы.Загрузить.Заголовок = "Загрузить";
		Элементы.ОставшеесяВремя.Заголовок = "";
		ПолучениеПисемВыполняется = Ложь;
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка                                                        КАК Ссылка,
	|	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты                                         КАК АдресЭлектроннойПочты,
	|	УчетныеЗаписиЭлектроннойПочты.Наименование                                                  КАК Наименование,
	|	ЕСТЬNULL(НастройкиУчетныхЗаписейЭлектроннойПочты.ПомещатьПисьмоВПапкуПисьмаОснования, ЛОЖЬ) КАК ПомещатьПисьмоВПапкуПисьмаОснования,
	|	ВЫБОР
	|		КОГДА УчетныеЗаписиЭлектроннойПочты.ВладелецУчетнойЗаписи = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(НастройкиУчетныхЗаписейЭлектроннойПочты.ОтветственныйЗаОбработкуПисем, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	|		ИНАЧЕ УчетныеЗаписиЭлектроннойПочты.ВладелецУчетнойЗаписи
	|	КОНЕЦ                                                                                       КАК ОтветственныйЗаОбработкуПисем,
	|	УчетныеЗаписиЭлектроннойПочты.ОставлятьКопииСообщенийНаСервере                              КАК ОставлятьКопии,
	|	УчетныеЗаписиЭлектроннойПочты.ПериодХраненияСообщенийНаСервере                              КАК ОставлятьДней,
	|	УчетныеЗаписиЭлектроннойПочты.ИмяПользователя                                               КАК ИмяПользователя,
	|	УчетныеЗаписиЭлектроннойПочты.ПротоколВходящейПочты                                         КАК ПротоколВходящейПочты,
	|	ЕСТЬNULL(ДатыПоследнейЗагрузкиПочтовыхСообщений.ДатаЗагрузкиПисем, ДАТАВРЕМЯ(1, 1, 1))      КАК ДатаЗагрузкиПисем,
	|	ВЫБОР
	|		КОГДА УчетныеЗаписиЭлектроннойПочты.ПротоколВходящейПочты = ""IMAP""
	|			ТОГДА ЕСТЬNULL(НастройкиУчетныхЗаписейЭлектроннойПочты.ОбработкаПисемВыполняетсяВДругомПочтовомКлиенте, ЛОЖЬ)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                                                        КАК ОбработкаПисемВедетсяВДругомПочтовомКлиенте
	// +CRM
	|	,УчетныеЗаписиЭлектроннойПочты.CRM_СинхронизироватьПапкиСПочтовымСервером КАК СинхронизироватьПапкиСПочтовымСервером,
	|	УчетныеЗаписиЭлектроннойПочты.CRM_ИсточникЛидов КАК CRM_ИсточникЛидов,
	|	ВЫБОР
	|		КОГДА ПапкиУчетныхЗаписей.Папка ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА ПапкиУчетныхЗаписей.Папка.CRM_ИмяНаСервере = """"
	|			ТОГДА ПапкиУчетныхЗаписей.Папка.Наименование
	|		ИНАЧЕ ПапкиУчетныхЗаписей.Папка.CRM_ИмяНаСервере
	|	КОНЕЦ КАК ИмяПапкиВходящие,
	|	УчетныеЗаписиЭлектроннойПочты.CRM_ПериодСинхронизацииПапок КАК ПериодСинхронизации,
	|	УчетныеЗаписиЭлектроннойПочты.CRM_ЗагружатьВложенияПриПолученииПисем КАК ЗагружатьВложения
	// -CRM
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетныхЗаписейЭлектроннойПочты КАК НастройкиУчетныхЗаписейЭлектроннойПочты
	|		ПО (НастройкиУчетныхЗаписейЭлектроннойПочты.УчетнаяЗаписьЭлектроннойПочты = УчетныеЗаписиЭлектроннойПочты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПоследнейЗагрузкиПочтовыхСообщений КАК ДатыПоследнейЗагрузкиПочтовыхСообщений
	|		ПО (ДатыПоследнейЗагрузкиПочтовыхСообщений.УчетнаяЗапись = УчетныеЗаписиЭлектроннойПочты.Ссылка)
	// +CRM
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ПапкиУчетныхЗаписей КАК ПапкиУчетныхЗаписей
	|		ПО УчетныеЗаписиЭлектроннойПочты.Ссылка = ПапкиУчетныхЗаписей.УчетнаяЗапись
	|			И ПапкиУчетныхЗаписей.ВидПапки = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыПапокЭлектроннойПочты.Входящие)
	// -CRM
	|ГДЕ
	|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляПолучения
	// +CRM
	|	И УчетныеЗаписиЭлектроннойПочты.Ссылка =&УчетнаяЗапись";
	// -CRM
	
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДанныеУчетнойЗаписи = Новый Структура;
		Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
			ДанныеУчетнойЗаписи.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
		КонецЦикла;
	Иначе
		ТекстСообщения = НСтр("ru='Получение почты для данной учетной записи недоступно.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыПроцедуры = Новый Структура;
	// +CRM
	ПараметрыПроцедуры.Вставить("ДанныеУчетнойЗаписи", ДанныеУчетнойЗаписи);
	ПараметрыПроцедуры.Вставить("ДатаНачалаПериода", ДатаНачалаПериода);
	ПараметрыПроцедуры.Вставить("ДатаОкончанияПериода", ДатаОкончанияПериода);
	ПараметрыПроцедуры.Вставить("ОбрабатыватьКакНовые", ОбрабатыватьКакНовые);
	// -CRM
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение электронной почты за период'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("CRM_УправлениеЭлектроннойПочтой.ПолучитьПочтуЗаПериод",
		ПараметрыПроцедуры, ПараметрыВыполнения);
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОтменитьВыполнениеЗадания(ИдентификаторЗадания)
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда 
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПолучениеПисемВыполняется = Ложь;
	Элементы.Загрузить.Заголовок = "Загрузить";
	Элементы.ОставшеесяВремя.Заголовок = "";
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Оповестить("ЗагруженаИсторияПисем", УчетнаяЗапись, ЭтотОбъект);
		
		РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Прогресс = 100;
		
		Если РезультатВыполнения = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если РезультатВыполнения.ЕстьОшибки Тогда
			ПоказатьОповещениеПользователя(Заголовок, ДополнительныеПараметры.НавигационнаяСсылка, 
				НСтр("ru = 'Не удалось выполнить все действия. Технические подробности для администратора в журнале регистрации.'"), 
				БиблиотекаКартинок.Ошибка32, СтатусОповещенияПользователя.Важное);
		Иначе	
			ПоказатьОповещениеПользователя(Заголовок, ДополнительныеПараметры.НавигационнаяСсылка,
				CRM_УправлениеЭлектроннойПочтойКлиент.РезультатОтправкиПолученияПисем(РезультатВыполнения));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрогрессЗагрузки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус <> "Выполняется" Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Прогресс <> Неопределено Тогда
		Прогресс = Результат.Прогресс.Процент;
		Элементы.ОставшеесяВремя.Заголовок = Результат.Прогресс.Текст;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементыФормы(ПолучениеПисемВыполняется)

	Если ПолучениеПисемВыполняется Тогда
		Прогресс = 0;
		Элементы.Загрузить.Заголовок = "Отмена";
	Иначе
		Элементы.Загрузить.Заголовок = "Загрузить";
		Элементы.ОставшеесяВремя.Заголовок = "";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
